HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxDma_reg.h
/** \\brief  27A0, DMA Channel Read Data CRC Register */
#define DMA_CH61_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00127A0u)

/** Alias (User Manual Name) for DMA_CH61_RDCRCR.
* To use register names with standard convension, please use DMA_CH61_RDCRCR.
*/
#define	DMA_RDCRCR061	(DMA_CH61_RDCRCR)

/** \\brief  27A8, DMA Channel Source Address Register */
#define DMA_CH61_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00127A8u)

/** Alias (User Manual Name) for DMA_CH61_SADR.
* To use register names with standard convension, please use DMA_CH61_SADR.
*/
#define	DMA_SADR061	(DMA_CH61_SADR)

/** \\brief  27A4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH61_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00127A4u)

/** Alias (User Manual Name) for DMA_CH61_SDCRCR.
* To use register names with standard convension, please use DMA_CH61_SDCRCR.
*/
#define	DMA_SDCRCR061	(DMA_CH61_SDCRCR)

/** \\brief  27B8, DMA Channel Shadow Address Register */
#define DMA_CH61_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00127B8u)

/** Alias (User Manual Name) for DMA_CH61_SHADR.
* To use register names with standard convension, please use DMA_CH61_SHADR.
*/
#define	DMA_SHADR061	(DMA_CH61_SHADR)

/** \\brief  27D0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH62_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00127D0u)

/** Alias (User Manual Name) for DMA_CH62_ADICR.
* To use register names with standard convension, please use DMA_CH62_ADICR.
*/
#define	DMA_ADICR062	(DMA_CH62_ADICR)

/** \\brief  27D4, DMA Channel Configuration Register */
#define DMA_CH62_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00127D4u)

/** Alias (User Manual Name) for DMA_CH62_CHCFGR.
* To use register names with standard convension, please use DMA_CH62_CHCFGR.
*/
#define	DMA_CHCFGR062	(DMA_CH62_CHCFGR)

/** \\brief  27DC, DMARAM Channel Control and Status Register */
#define DMA_CH62_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00127DCu)

/** Alias (User Manual Name) for DMA_CH62_CHCSR.
* To use register names with standard convension, please use DMA_CH62_CHCSR.
*/
#define	DMA_CHCSR062	(DMA_CH62_CHCSR)

/** \\brief  27CC, DMA Channel Destination Address Register x */
#define DMA_CH62_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00127CCu)

/** Alias (User Manual Name) for DMA_CH62_DADR.
* To use register names with standard convension, please use DMA_CH62_DADR.
*/
#define	DMA_DADR062	(DMA_CH62_DADR)

/** \\brief  27C0, DMA Channel Read Data CRC Register */
#define DMA_CH62_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00127C0u)

/** Alias (User Manual Name) for DMA_CH62_RDCRCR.
* To use register names with standard convension, please use DMA_CH62_RDCRCR.
*/
#define	DMA_RDCRCR062	(DMA_CH62_RDCRCR)

/** \\brief  27C8, DMA Channel Source Address Register */
#define DMA_CH62_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00127C8u)

/** Alias (User Manual Name) for DMA_CH62_SADR.
* To use register names with standard convension, please use DMA_CH62_SADR.
*/
#define	DMA_SADR062	(DMA_CH62_SADR)

/** \\brief  27C4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH62_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00127C4u)

/** Alias (User Manual Name) for DMA_CH62_SDCRCR.
* To use register names with standard convension, please use DMA_CH62_SDCRCR.
*/
#define	DMA_SDCRCR062	(DMA_CH62_SDCRCR)

/** \\brief  27D8, DMA Channel Shadow Address Register */
#define DMA_CH62_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00127D8u)

/** Alias (User Manual Name) for DMA_CH62_SHADR.
* To use register names with standard convension, please use DMA_CH62_SHADR.
*/
#define	DMA_SHADR062	(DMA_CH62_SHADR)

/** \\brief  27F0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH63_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00127F0u)

/** Alias (User Manual Name) for DMA_CH63_ADICR.
* To use register names with standard convension, please use DMA_CH63_ADICR.
*/
#define	DMA_ADICR063	(DMA_CH63_ADICR)

/** \\brief  27F4, DMA Channel Configuration Register */
#define DMA_CH63_CHCFGR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00127F4u)

/** Alias (User Manual Name) for DMA_CH63_CHCFGR.
* To use register names with standard convension, please use DMA_CH63_CHCFGR.
*/
#define	DMA_CHCFGR063	(DMA_CH63_CHCFGR)

/** \\brief  27FC, DMARAM Channel Control and Status Register */
#define DMA_CH63_CHCSR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00127FCu)

/** Alias (User Manual Name) for DMA_CH63_CHCSR.
* To use register names with standard convension, please use DMA_CH63_CHCSR.
*/
#define	DMA_CHCSR063	(DMA_CH63_CHCSR)

/** \\brief  27EC, DMA Channel Destination Address Register x */
#define DMA_CH63_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00127ECu)

/** Alias (User Manual Name) for DMA_CH63_DADR.
* To use register names with standard convension, please use DMA_CH63_DADR.
*/
#define	DMA_DADR063	(DMA_CH63_DADR)

/** \\brief  27E0, DMA Channel Read Data CRC Register */
#define DMA_CH63_RDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00127E0u)

/** Alias (User Manual Name) for DMA_CH63_RDCRCR.
* To use register names with standard convension, please use DMA_CH63_RDCRCR.
*/
#define	DMA_RDCRCR063	(DMA_CH63_RDCRCR)

/** \\brief  27E8, DMA Channel Source Address Register */
#define DMA_CH63_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00127E8u)

/** Alias (User Manual Name) for DMA_CH63_SADR.
* To use register names with standard convension, please use DMA_CH63_SADR.
*/
#define	DMA_SADR063	(DMA_CH63_SADR)

/** \\brief  27E4, DMA Channel Source and Destination Address CRC Register */
#define DMA_CH63_SDCRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00127E4u)

/** Alias (User Manual Name) for DMA_CH63_SDCRCR.
* To use register names with standard convension, please use DMA_CH63_SDCRCR.
*/
#define	DMA_SDCRCR063	(DMA_CH63_SDCRCR)

/** \\brief  27F8, DMA Channel Shadow Address Register */
#define DMA_CH63_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00127F8u)

/** Alias (User Manual Name) for DMA_CH63_SHADR.
* To use register names with standard convension, please use DMA_CH63_SHADR.
*/
#define	DMA_SHADR063	(DMA_CH63_SHADR)

/** \\brief  20D0, DMA Channel Address and Interrupt Control Register x */
#define DMA_CH6_ADICR /*lint --e(923)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00120D0u)

