HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxDma_reg.h
/** \\brief  1808, DMA Channel Hardware Resource Register */
#define DMA_HRR2 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011808u)

/** Alias (User Manual Name) for DMA_HRR2.
* To use register names with standard convension, please use DMA_HRR2.
*/
#define	DMA_HRR002	(DMA_HRR2)

/** \\brief  1850, DMA Channel Hardware Resource Register */
#define DMA_HRR20 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011850u)

/** Alias (User Manual Name) for DMA_HRR20.
* To use register names with standard convension, please use DMA_HRR20.
*/
#define	DMA_HRR020	(DMA_HRR20)

/** \\brief  1854, DMA Channel Hardware Resource Register */
#define DMA_HRR21 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011854u)

/** Alias (User Manual Name) for DMA_HRR21.
* To use register names with standard convension, please use DMA_HRR21.
*/
#define	DMA_HRR021	(DMA_HRR21)

/** \\brief  1858, DMA Channel Hardware Resource Register */
#define DMA_HRR22 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011858u)

/** Alias (User Manual Name) for DMA_HRR22.
* To use register names with standard convension, please use DMA_HRR22.
*/
#define	DMA_HRR022	(DMA_HRR22)

/** \\brief  185C, DMA Channel Hardware Resource Register */
#define DMA_HRR23 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF001185Cu)

/** Alias (User Manual Name) for DMA_HRR23.
* To use register names with standard convension, please use DMA_HRR23.
*/
#define	DMA_HRR023	(DMA_HRR23)

/** \\brief  1860, DMA Channel Hardware Resource Register */
#define DMA_HRR24 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011860u)

/** Alias (User Manual Name) for DMA_HRR24.
* To use register names with standard convension, please use DMA_HRR24.
*/
#define	DMA_HRR024	(DMA_HRR24)

/** \\brief  1864, DMA Channel Hardware Resource Register */
#define DMA_HRR25 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011864u)

/** Alias (User Manual Name) for DMA_HRR25.
* To use register names with standard convension, please use DMA_HRR25.
*/
#define	DMA_HRR025	(DMA_HRR25)

/** \\brief  1868, DMA Channel Hardware Resource Register */
#define DMA_HRR26 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011868u)

/** Alias (User Manual Name) for DMA_HRR26.
* To use register names with standard convension, please use DMA_HRR26.
*/
#define	DMA_HRR026	(DMA_HRR26)

/** \\brief  186C, DMA Channel Hardware Resource Register */
#define DMA_HRR27 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF001186Cu)

/** Alias (User Manual Name) for DMA_HRR27.
* To use register names with standard convension, please use DMA_HRR27.
*/
#define	DMA_HRR027	(DMA_HRR27)

/** \\brief  1870, DMA Channel Hardware Resource Register */
#define DMA_HRR28 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011870u)

/** Alias (User Manual Name) for DMA_HRR28.
* To use register names with standard convension, please use DMA_HRR28.
*/
#define	DMA_HRR028	(DMA_HRR28)

/** \\brief  1874, DMA Channel Hardware Resource Register */
#define DMA_HRR29 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011874u)

/** Alias (User Manual Name) for DMA_HRR29.
* To use register names with standard convension, please use DMA_HRR29.
*/
#define	DMA_HRR029	(DMA_HRR29)

/** \\brief  180C, DMA Channel Hardware Resource Register */
#define DMA_HRR3 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF001180Cu)

/** Alias (User Manual Name) for DMA_HRR3.
* To use register names with standard convension, please use DMA_HRR3.
*/
#define	DMA_HRR003	(DMA_HRR3)

/** \\brief  1878, DMA Channel Hardware Resource Register */
#define DMA_HRR30 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011878u)

/** Alias (User Manual Name) for DMA_HRR30.
* To use register names with standard convension, please use DMA_HRR30.
*/
#define	DMA_HRR030	(DMA_HRR30)

/** \\brief  187C, DMA Channel Hardware Resource Register */
#define DMA_HRR31 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF001187Cu)

/** Alias (User Manual Name) for DMA_HRR31.
* To use register names with standard convension, please use DMA_HRR31.
*/
#define	DMA_HRR031	(DMA_HRR31)

/** \\brief  1880, DMA Channel Hardware Resource Register */
#define DMA_HRR32 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011880u)

/** Alias (User Manual Name) for DMA_HRR32.
* To use register names with standard convension, please use DMA_HRR32.
*/
#define	DMA_HRR032	(DMA_HRR32)

/** \\brief  1884, DMA Channel Hardware Resource Register */
#define DMA_HRR33 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011884u)

/** Alias (User Manual Name) for DMA_HRR33.
* To use register names with standard convension, please use DMA_HRR33.
*/
#define	DMA_HRR033	(DMA_HRR33)

/** \\brief  1888, DMA Channel Hardware Resource Register */
#define DMA_HRR34 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011888u)

/** Alias (User Manual Name) for DMA_HRR34.
* To use register names with standard convension, please use DMA_HRR34.
*/
#define	DMA_HRR034	(DMA_HRR34)

/** \\brief  188C, DMA Channel Hardware Resource Register */
#define DMA_HRR35 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF001188Cu)

/** Alias (User Manual Name) for DMA_HRR35.
* To use register names with standard convension, please use DMA_HRR35.
*/
#define	DMA_HRR035	(DMA_HRR35)

/** \\brief  1890, DMA Channel Hardware Resource Register */
#define DMA_HRR36 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011890u)

/** Alias (User Manual Name) for DMA_HRR36.
* To use register names with standard convension, please use DMA_HRR36.
*/
#define	DMA_HRR036	(DMA_HRR36)

/** \\brief  1894, DMA Channel Hardware Resource Register */
#define DMA_HRR37 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011894u)

/** Alias (User Manual Name) for DMA_HRR37.
* To use register names with standard convension, please use DMA_HRR37.
*/
#define	DMA_HRR037	(DMA_HRR37)

/** \\brief  1898, DMA Channel Hardware Resource Register */
#define DMA_HRR38 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF0011898u)

/** Alias (User Manual Name) for DMA_HRR38.
* To use register names with standard convension, please use DMA_HRR38.
*/
#define	DMA_HRR038	(DMA_HRR38)

/** \\brief  189C, DMA Channel Hardware Resource Register */
#define DMA_HRR39 /*lint --e(923)*/ (*(volatile Ifx_DMA_HRR*)0xF001189Cu)

